<a href="https://colab.research.google.com/github/zeroam/data_engineering_study/blob/master/week3/review_sql_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://<ID>:<PW>@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

## Channel 테이블 만들어보기

### 1. 테이블을 만들고 INSERT

In [3]:
%%sql
DROP TABLE IF EXISTS imdff0803.channel;

CREATE TABLE imdff0803.channel (
    channel varchar(32) primary key
);

INSERT INTO imdff0803.channel
VALUES ('FACEBOOK'), ('GOOGLE');

SELECT * FROM imdff0803.channel;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.
2 rows affected.
2 rows affected.

[('FACEBOOK',), ('GOOGLE',)]

### 2. 조회한 레코드 기반으로 Table 생성

In [4]:
%%sql
DROP TABLE IF EXISTS imdff0803.channel;

CREATE TABLE imdff0803.channel AS
SELECT DISTINCT channel FROM raw_data.user_session_channel;

SELECT * FROM imdff0803.channel;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.
6 rows affected.

[('Organic',),
 ('Google',),
 ('Instagram',),
 ('Naver',),
 ('Youtube',),
 ('Facebook',)]

### 3. 컬럼명 변경하기

In [5]:
%%sql
ALTER TABLE imdff0803.channel RENAME channel TO channelname;

INSERT INTO imdff0803.channel VALUES ('TIKTOK');

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
1 rows affected.

[]

## IN & LIKE/ILIKE

### 1. IN 활용하기

In [6]:
%%sql
SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel IN ('Google', 'Facebook');

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

### 2.1. ILIKE 활용하기

In [7]:
%%sql
SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel ILIKE 'Google' or channel ILIKE 'Facebook';

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

### 2.2. ILIKE 활용하기 (%)

In [8]:
%%sql
SELECT DISTINCT channel
FROM raw_data.user_session_channel
WHERE channel NOT ILIKE '%o%';

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('Naver',), ('Instagram',)]

### 2.3 ILIKE 활용하기 (NOT)

In [9]:
%%sql
SELECT DISTINCT channel
FROM raw_data.user_session_channel
WHERE channel ILIKE '%o%';

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[('Organic',), ('Google',), ('Facebook',), ('Youtube',)]

## session이 가장 많이 생성되는 시간대

### 1. 시간대

In [10]:
%%sql
SELECT EXTRACT(HOUR FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
24 rows affected.

[(15, 15339),
 (16, 14140),
 (14, 13417),
 (17, 10698),
 (13, 9035),
 (18, 7469),
 (19, 5278),
 (20, 3956),
 (12, 3852),
 (21, 3238),
 (22, 2801),
 (23, 2348),
 (0, 1870),
 (11, 1411),
 (1, 1328),
 (2, 1125),
 (10, 870),
 (3, 815),
 (4, 703),
 (5, 611),
 (6, 491),
 (9, 340),
 (7, 236),
 (8, 149)]

### 2. 요일

In [11]:
%%sql
SELECT EXTRACT(DOW FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(5, 15091),
 (3, 14999),
 (4, 14901),
 (2, 14762),
 (1, 14625),
 (6, 14068),
 (0, 13074)]

### 3. 시간대별 사용자

In [12]:
%%sql
SELECT EXTRACT(HOUR FROM st.ts), COUNT(DISTINCT(usc.userid))
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
24 rows affected.

[(17, 805),
 (16, 792),
 (18, 759),
 (15, 755),
 (19, 684),
 (14, 675),
 (20, 657),
 (21, 587),
 (22, 553),
 (23, 506),
 (13, 503),
 (0, 407),
 (1, 341),
 (12, 313),
 (2, 291),
 (3, 223),
 (4, 173),
 (11, 166),
 (5, 130),
 (6, 104),
 (10, 80),
 (7, 69),
 (9, 48),
 (8, 38)]

# raw_data.channel의 채널벌 사용자수 세기
- raw_data.channel.channelname에 매칭하는 채널을 가진 사용자 수 세기
- 이 경우 어떤 테이블이 베이스가 되는지 먼저 결정
- 다음으로 어떤 테이블을 어떤 조인을 연결할 지 결정

In [13]:
%%sql
SELECT ch.channelname, COUNT(DISTINCT(usc.userid))
FROM raw_data.channel ch
LEFT JOIN raw_data.user_session_channel usc
ON ch.channelname = usc.channel
GROUP BY 1
ORDER BY 1;

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('Facebook', 889),
 ('Google', 893),
 ('Instagram', 895),
 ('Naver', 882),
 ('Organic', 895),
 ('TIKTOK', 0),
 ('Youtube', 889)]

## 사용자별로 처음 채널과 마지막 채널 알아내기

In [14]:
result = %sql SELECT ts, channel, ROW_NUMBER() OVER (PARTITION BY userid ORDER BY ts) as N FROM raw_data.user_session_channel usc JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid WHERE userid = 251

df = result.DataFrame()
print(df.head())

print(f"처음 채널: {df.iloc[0].channel}")
print(f"마지막 채널: {df.iloc[-1].channel}")

 * postgresql://imdff0803:***@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
216 rows affected.
                       ts    channel  n
0 2019-05-01 12:18:26.637   Facebook  1
1 2019-05-02 13:06:12.047  Instagram  2
2 2019-05-03 13:43:21.857  Instagram  3
3 2019-05-04 13:54:00.610  Instagram  4
4 2019-05-05 13:30:08.260     Google  5
처음 채널: Facebook
마지막 채널: Google